In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/

In [3]:
%%sql

# show databases;

create database views;
use views;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.
0 rows affected.

[]

In [4]:
%%sql

CREATE TABLE Employees (
    EmployeeID INT PRIMARY KEY,
    FirstName  VARCHAR(50),
    LastName   VARCHAR(50),
    Salary     DECIMAL(10,2),
    Department VARCHAR(50)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [5]:
%%sql

INSERT INTO Employees (EmployeeID, FirstName, LastName, Salary, Department)
VALUES
    (1, 'Alice', 'Johnson', 55000.00, 'Sales'),
    (2, 'Bob',   'Smith',   60000.00, 'IT'),
    (3, 'Carol', 'Davis',   52000.00, 'Sales'),
    (4, 'Dave',  'Wilson',  58000.00, 'HR');

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[]

In [6]:
%%sql

# -- Create a view that shows only employees in the Sales department
CREATE VIEW SalesEmployees AS
SELECT EmployeeID, FirstName, LastName, Salary
FROM Employees
WHERE Department = 'Sales';

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [7]:
%%sql

-- Now, you can query the view like a table:
SELECT * FROM SalesEmployees;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(1, 'Alice', 'Johnson', Decimal('55000.00')),
 (3, 'Carol', 'Davis', Decimal('52000.00'))]

In [8]:
%%sql
DROP TABLE IF EXISTS Orders;
DROP TABLE IF EXISTS Restaurants;

CREATE TABLE Restaurants (
    id INT  PRIMARY KEY,
    name VARCHAR(100) NOT NULL,
    location VARCHAR(100) NOT NULL
);

INSERT INTO Restaurants (id, name, location) VALUES
(1, 'ABC Bistro', 'New York'),
(2, 'The Foodie', 'Los Angeles'),
(3, 'Tasty Treat', 'Chicago');

CREATE TABLE Orders (
    order_id INT PRIMARY KEY,
    restaurant_id INT NOT NULL,
    order_date DATE NOT NULL
);

INSERT INTO Orders (order_id,restaurant_id, order_date) VALUES
(1, 1, '2023-01-01'),
(2, 1, '2023-01-02'),
(3, 2, '2023-01-05'),
(4, 4, '2023-01-07');

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.
3 rows affected.
0 rows affected.
4 rows affected.

[]

In [12]:
%%sql

## Inner Join (join)

select 
r.name as restaurant_name,
o.order_date 
from Restaurants r
join orders o on r.id = o.restaurant_id

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('ABC Bistro', datetime.date(2023, 1, 1)),
 ('ABC Bistro', datetime.date(2023, 1, 2)),
 ('The Foodie', datetime.date(2023, 1, 5))]

In [13]:
%%sql

## Left join

select 
r.name as restaurant_name,
o.order_date 
from Restaurants r
left join orders o on r.id = o.restaurant_id

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[('ABC Bistro', datetime.date(2023, 1, 2)),
 ('ABC Bistro', datetime.date(2023, 1, 1)),
 ('The Foodie', datetime.date(2023, 1, 5)),
 ('Tasty Treat', None)]

In [14]:
%%sql

## Right join

select 
r.name as restaurant_name,
o.order_date 
from Restaurants r
right join orders o on r.id = o.restaurant_id

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[('ABC Bistro', datetime.date(2023, 1, 1)),
 ('ABC Bistro', datetime.date(2023, 1, 2)),
 ('The Foodie', datetime.date(2023, 1, 5)),
 (None, datetime.date(2023, 1, 7))]

In [15]:
%%sql

-- Full outer join (simulation using UNION)
SELECT r.name AS restaurant_name, o.order_date
FROM Restaurants r
LEFT JOIN Orders o ON r.id = o.restaurant_id

UNION

SELECT r.name AS restaurant_name, o.order_date
FROM Restaurants r
RIGHT JOIN Orders o ON r.id = o.restaurant_id;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('ABC Bistro', datetime.date(2023, 1, 2)),
 ('ABC Bistro', datetime.date(2023, 1, 1)),
 ('The Foodie', datetime.date(2023, 1, 5)),
 ('Tasty Treat', None),
 (None, datetime.date(2023, 1, 7))]

In [16]:
%%sql

SELECT r.name AS restaurant_name, o.order_date
FROM Restaurants r
CROSS JOIN Orders o;

 * mysql+mysqlconnector://root:***@localhost/
12 rows affected.

[('Tasty Treat', datetime.date(2023, 1, 1)),
 ('The Foodie', datetime.date(2023, 1, 1)),
 ('ABC Bistro', datetime.date(2023, 1, 1)),
 ('Tasty Treat', datetime.date(2023, 1, 2)),
 ('The Foodie', datetime.date(2023, 1, 2)),
 ('ABC Bistro', datetime.date(2023, 1, 2)),
 ('Tasty Treat', datetime.date(2023, 1, 5)),
 ('The Foodie', datetime.date(2023, 1, 5)),
 ('ABC Bistro', datetime.date(2023, 1, 5)),
 ('Tasty Treat', datetime.date(2023, 1, 7)),
 ('The Foodie', datetime.date(2023, 1, 7)),
 ('ABC Bistro', datetime.date(2023, 1, 7))]

In [18]:
%%sql

SELECT r1.name AS restaurant_1, r2.name AS restaurant_2, r1.location
FROM Restaurants r1
JOIN Restaurants r2 
  ON r1.location = r2.location;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('ABC Bistro', 'ABC Bistro', 'New York'),
 ('The Foodie', 'The Foodie', 'Los Angeles'),
 ('Tasty Treat', 'Tasty Treat', 'Chicago')]

In [19]:
%%sql

-- This works if both tables have a column named `id` or `restaurant_id`
SELECT *
FROM Restaurants
NATURAL JOIN Orders;

 * mysql+mysqlconnector://root:***@localhost/
12 rows affected.

[(3, 'Tasty Treat', 'Chicago', 1, 1, datetime.date(2023, 1, 1)),
 (2, 'The Foodie', 'Los Angeles', 1, 1, datetime.date(2023, 1, 1)),
 (1, 'ABC Bistro', 'New York', 1, 1, datetime.date(2023, 1, 1)),
 (3, 'Tasty Treat', 'Chicago', 2, 1, datetime.date(2023, 1, 2)),
 (2, 'The Foodie', 'Los Angeles', 2, 1, datetime.date(2023, 1, 2)),
 (1, 'ABC Bistro', 'New York', 2, 1, datetime.date(2023, 1, 2)),
 (3, 'Tasty Treat', 'Chicago', 3, 2, datetime.date(2023, 1, 5)),
 (2, 'The Foodie', 'Los Angeles', 3, 2, datetime.date(2023, 1, 5)),
 (1, 'ABC Bistro', 'New York', 3, 2, datetime.date(2023, 1, 5)),
 (3, 'Tasty Treat', 'Chicago', 4, 4, datetime.date(2023, 1, 7)),
 (2, 'The Foodie', 'Los Angeles', 4, 4, datetime.date(2023, 1, 7)),
 (1, 'ABC Bistro', 'New York', 4, 4, datetime.date(2023, 1, 7))]